---
type: CutMarkType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 7
tags: [revit-api, class]
---

# CutMarkType

`Autodesk.Revit.DB.Architecture.CutMarkType` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CutLineAngle | 2013 | `public double CutLineAngle { get ; set ; }` |
| Property | CutLineDistance | 2013 | `public double CutLineDistance { get ; set ; }` |
| Property | CutLineExtension | 2013 | `public double CutLineExtension { get ; set ; }` |
| Property | CutLineType | 2013 | `public CutLineType CutLineType { get ; set ; }` |
| Property | CutMarkSymbol | 2013 | `public CutMarkSymbol CutMarkSymbol { get ; set ; }` |
| Property | CutMarkSymbolSize | 2013 | `public double CutMarkSymbolSize { get ; set ; }` |
| Property | Parameter | — | `` |